In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {
    'first': ['John', 'Bob', 'Eve', 'Charlie', None, np.nan, 'Sophia', 'NA', 'MISSING'],
    'last': ['Doe', 'Johnson', 'Anderson', 'Brown', 'Miller', 'Wilson', 'Davis', 'Martinez', 'OKAY'],
    'email': ['john.doe@example.com', 'NA', None, 'charlie.brown@example.com',
              'grace.miller@example.com', 'will@gmail.com', np.nan, 'liam.martinez@example.com', 'MISSING'],
    'age': [25, np.nan, None, 40, 28, 45, np.nan, 37, 'MISSING'],
    'dob': ['1998-03-15', '1980-05-10', '1975-09-07', '1995-08-18', '1995-08-18', '1989-06-25',
            'NA', 'NA', 'MISSING']
}

df = pd.DataFrame(data)
df

     first      last                      email      age         dob
0     John       Doe       john.doe@example.com       25  1998-03-15
1      Bob   Johnson                         NA      NaN  1980-05-10
2      Eve  Anderson                       None     None  1975-09-07
3  Charlie     Brown  charlie.brown@example.com       40  1995-08-18
4     None    Miller   grace.miller@example.com       28  1995-08-18
5      NaN    Wilson             will@gmail.com       45  1989-06-25
6   Sophia     Davis                        NaN      NaN          NA
7       NA  Martinez  liam.martinez@example.com       37          NA
8  MISSING      OKAY                    MISSING  MISSING     MISSING

In [3]:
# Convert 'NA' and 'MISSING' to actual NaN values
df = df.replace(['NA', 'MISSING'], np.nan)
df

# df.replace('NA', np.nan, inplace=True)
# df.replace('MISSING', np.nan, inplace=True)

     first      last                      email   age         dob
0     John       Doe       john.doe@example.com  25.0  1998-03-15
1      Bob   Johnson                        NaN   NaN  1980-05-10
2      Eve  Anderson                       None   NaN  1975-09-07
3  Charlie     Brown  charlie.brown@example.com  40.0  1995-08-18
4     None    Miller   grace.miller@example.com  28.0  1995-08-18
5      NaN    Wilson             will@gmail.com  45.0  1989-06-25
6   Sophia     Davis                        NaN   NaN         NaN
7      NaN  Martinez  liam.martinez@example.com  37.0         NaN
8      NaN      OKAY                        NaN   NaN         NaN

In [4]:
# Detect missing values.
df.isna()

   first   last  email    age    dob
0  False  False  False  False  False
1  False  False   True   True  False
2  False  False   True   True  False
3  False  False  False  False  False
4   True  False  False  False  False
5   True  False  False  False  False
6  False  False   True   True   True
7   True  False  False  False   True
8   True  False   True   True   True

In [5]:
# Fill NA/NaN values using the specified method.
df.fillna("<MISSING>")

       first      last                      email        age         dob
0       John       Doe       john.doe@example.com       25.0  1998-03-15
1        Bob   Johnson                  <MISSING>  <MISSING>  1980-05-10
2        Eve  Anderson                  <MISSING>  <MISSING>  1975-09-07
3    Charlie     Brown  charlie.brown@example.com       40.0  1995-08-18
4  <MISSING>    Miller   grace.miller@example.com       28.0  1995-08-18
5  <MISSING>    Wilson             will@gmail.com       45.0  1989-06-25
6     Sophia     Davis                  <MISSING>  <MISSING>   <MISSING>
7  <MISSING>  Martinez  liam.martinez@example.com       37.0   <MISSING>
8  <MISSING>      OKAY                  <MISSING>  <MISSING>   <MISSING>

In [6]:
# Remove row's missing values 
df.dropna() # axis=0/index

     first   last                      email   age         dob
0     John    Doe       john.doe@example.com  25.0  1998-03-15
3  Charlie  Brown  charlie.brown@example.com  40.0  1995-08-18

In [7]:
# Remove column if there is single missing value 
df.dropna(axis='columns')

       last
0       Doe
1   Johnson
2  Anderson
3     Brown
4    Miller
5    Wilson
6     Davis
7  Martinez
8      OKAY

In [8]:
# Exercise: Drop all rows that contain at least one missing value
df.dropna(axis='index', how='any')

     first   last                      email   age         dob
0     John    Doe       john.doe@example.com  25.0  1998-03-15
3  Charlie  Brown  charlie.brown@example.com  40.0  1995-08-18

In [9]:
# Exercise: Drop only the rows where column 'Age' has missing values
df.dropna(subset=['email'])

     first      last                      email   age         dob
0     John       Doe       john.doe@example.com  25.0  1998-03-15
3  Charlie     Brown  charlie.brown@example.com  40.0  1995-08-18
4     None    Miller   grace.miller@example.com  28.0  1995-08-18
5      NaN    Wilson             will@gmail.com  45.0  1989-06-25
7      NaN  Martinez  liam.martinez@example.com  37.0         NaN

In [10]:
df

     first      last                      email   age         dob
0     John       Doe       john.doe@example.com  25.0  1998-03-15
1      Bob   Johnson                        NaN   NaN  1980-05-10
2      Eve  Anderson                       None   NaN  1975-09-07
3  Charlie     Brown  charlie.brown@example.com  40.0  1995-08-18
4     None    Miller   grace.miller@example.com  28.0  1995-08-18
5      NaN    Wilson             will@gmail.com  45.0  1989-06-25
6   Sophia     Davis                        NaN   NaN         NaN
7      NaN  Martinez  liam.martinez@example.com  37.0         NaN
8      NaN      OKAY                        NaN   NaN         NaN

In [11]:
# Exercise:  Drop rows with more than Four missing values
df.dropna(thresh=4)
# non-missing values required to keep a row or column.
# If the number of non-missing/valid values is below the specified threshold, the row or column is dropped.

     first    last                      email   age         dob
0     John     Doe       john.doe@example.com  25.0  1998-03-15
3  Charlie   Brown  charlie.brown@example.com  40.0  1995-08-18
4     None  Miller   grace.miller@example.com  28.0  1995-08-18
5      NaN  Wilson             will@gmail.com  45.0  1989-06-25

In [12]:
print(df) 
df.dropna(how='any') # Drop the row if any of its elements are missing.

     first      last                      email   age         dob
0     John       Doe       john.doe@example.com  25.0  1998-03-15
1      Bob   Johnson                        NaN   NaN  1980-05-10
2      Eve  Anderson                       None   NaN  1975-09-07
3  Charlie     Brown  charlie.brown@example.com  40.0  1995-08-18
4     None    Miller   grace.miller@example.com  28.0  1995-08-18
5      NaN    Wilson             will@gmail.com  45.0  1989-06-25
6   Sophia     Davis                        NaN   NaN         NaN
7      NaN  Martinez  liam.martinez@example.com  37.0         NaN
8      NaN      OKAY                        NaN   NaN         NaN

     first   last                      email   age         dob
0     John    Doe       john.doe@example.com  25.0  1998-03-15
3  Charlie  Brown  charlie.brown@example.com  40.0  1995-08-18

In [13]:
df.replace('OKAY', np.nan, inplace=True)
print(df)
df.dropna(how='all') # Drop the row only if all of its elements are missing.

     first      last                      email   age         dob
0     John       Doe       john.doe@example.com  25.0  1998-03-15
1      Bob   Johnson                        NaN   NaN  1980-05-10
2      Eve  Anderson                       None   NaN  1975-09-07
3  Charlie     Brown  charlie.brown@example.com  40.0  1995-08-18
4     None    Miller   grace.miller@example.com  28.0  1995-08-18
5      NaN    Wilson             will@gmail.com  45.0  1989-06-25
6   Sophia     Davis                        NaN   NaN         NaN
7      NaN  Martinez  liam.martinez@example.com  37.0         NaN
8      NaN       NaN                        NaN   NaN         NaN

     first      last                      email   age         dob
0     John       Doe       john.doe@example.com  25.0  1998-03-15
1      Bob   Johnson                        NaN   NaN  1980-05-10
2      Eve  Anderson                       None   NaN  1975-09-07
3  Charlie     Brown  charlie.brown@example.com  40.0  1995-08-18
4     None    Miller   grace.miller@example.com  28.0  1995-08-18
5      NaN    Wilson             will@gmail.com  45.0  1989-06-25
6   Sophia     Davis                        NaN   NaN         NaN
7      NaN  Martinez  liam.martinez@example.com  37.0         NaN

In [14]:
# Exercise: Drop rows where both 'email' and 'age' are missing with columns 'email' and 'age',
df.dropna(axis='index', how='all', subset=['email', 'age'])

     first      last                      email   age         dob
0     John       Doe       john.doe@example.com  25.0  1998-03-15
3  Charlie     Brown  charlie.brown@example.com  40.0  1995-08-18
4     None    Miller   grace.miller@example.com  28.0  1995-08-18
5      NaN    Wilson             will@gmail.com  45.0  1989-06-25
7      NaN  Martinez  liam.martinez@example.com  37.0         NaN

In [15]:
# Exercise: Fill missing values in 'age' column with the mean age

df_filled_age = df.copy()
df_filled_age['age'] = pd.to_numeric(df_filled_age['age'], errors='coerce')  # Convert to numeric
mean_age = df_filled_age['age'].mean()
df_filled_age['age'].fillna(mean_age, inplace=True)

print("\nExercise 3: DataFrame after filling missing values in 'age' column with the mean age:")
df_filled_age

Exercise 3: DataFrame after filling missing values in 'age' column with the mean age:

     first      last                      email   age         dob
0     John       Doe       john.doe@example.com  25.0  1998-03-15
1      Bob   Johnson                        NaN  35.0  1980-05-10
2      Eve  Anderson                       None  35.0  1975-09-07
3  Charlie     Brown  charlie.brown@example.com  40.0  1995-08-18
4     None    Miller   grace.miller@example.com  28.0  1995-08-18
5      NaN    Wilson             will@gmail.com  45.0  1989-06-25
6   Sophia     Davis                        NaN  35.0         NaN
7      NaN  Martinez  liam.martinez@example.com  37.0         NaN
8      NaN       NaN                        NaN  35.0         NaN

In [16]:
df.dtypes

first     object
last      object
email     object
age      float64
dob       object
dtype: object

In [17]:
# Exercise: Cast age column as a float data type.
df['age'] = df['age'].astype(float)
df

     first      last                      email   age         dob
0     John       Doe       john.doe@example.com  25.0  1998-03-15
1      Bob   Johnson                        NaN   NaN  1980-05-10
2      Eve  Anderson                       None   NaN  1975-09-07
3  Charlie     Brown  charlie.brown@example.com  40.0  1995-08-18
4     None    Miller   grace.miller@example.com  28.0  1995-08-18
5      NaN    Wilson             will@gmail.com  45.0  1989-06-25
6   Sophia     Davis                        NaN   NaN         NaN
7      NaN  Martinez  liam.martinez@example.com  37.0         NaN
8      NaN       NaN                        NaN   NaN         NaN